cagrid-1-0/caGrid/projects/cadsr/doc/NOTES.txt

Example protocol:
public gov.nih.nci.cadsr.umlproject.domain.UMLPackageMetadata[] findPackagesInProject(gov.nih.nci.cadsr.umlproject.domain.Project project) 

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
   <soapenv:Header>
      <wsa:MessageID soapenv:mustUnderstand="0">uuid:f69443f0-b9d7-11da-8ee2-f8f5daa12215</wsa:MessageID>
      <wsa:To soapenv:mustUnderstand="0">http://localhost:8081/wsrf/services/cagrid/CaDSRService</wsa:To>
      <wsa:Action soapenv:mustUnderstand="0">http://cadsr.cagrid.nci.nih.gov/CaDSRService/CaDSRServicePortType/findPackagesInProjectRequest</wsa:Action>
      <wsa:From soapenv:mustUnderstand="0">
         <wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
      </wsa:From>
   </soapenv:Header>
   <soapenv:Body>
      <findPackagesInProject xmlns="http://cadsr.cagrid.nci.nih.gov/CaDSRService">
         <project>
            <ns1:Project id="09B52C1E-FEB4-103D-E044-0003BA8EB8F1" shortName="Alt Name Test" longName="The Alt Name Test" description="Test Project" version="1" xmlns:ns1="gme://caCORE.cabig/3.0/gov.nih.nci.cadsr.umlproject.domain"/>
         </project>
      </findPackagesInProject>
 	</soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
   <soapenv:Header>
      <wsa:MessageID soapenv:mustUnderstand="0">uuid:f6d96340-b9d7-11da-a0eb-e3cfc372527d</wsa:MessageID>
      <wsa:To soapenv:mustUnderstand="0">http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:To>
      <wsa:Action soapenv:mustUnderstand="0">http://cadsr.cagrid.nci.nih.gov/CaDSRService/CaDSRServicePortType/findPackagesInProjectResponse</wsa:Action>
      <wsa:From soapenv:mustUnderstand="0">
         <wsa:Address>http://localhost:8081/wsrf/services/cagrid/CaDSRService</wsa:Address>
      </wsa:From>
      <wsa:RelatesTo RelationshipType="wsa:Reply" soapenv:mustUnderstand="0">uuid:f69443f0-b9d7-11da-8ee2-f8f5daa12215</wsa:RelatesTo>
   </soapenv:Header>
   <soapenv:Body>
      <findPackagesInProjectResponse xmlns="http://cadsr.cagrid.nci.nih.gov/CaDSRService">
         <ns1:UMLPackageMetadata id="0D7D07EE-0F0B-19D9-E044-0003BA8EB8F1" name="com.ludet.domain" xmlns:ns1="gme://caCORE.cabig/3.0/gov.nih.nci.cadsr.umlproject.domain"/>
      </findPackagesInProjectResponse>
   </soapenv:Body>
</soapenv:Envelope>
